{"index":{"title":"TL;DR","links":["work/","volunteer/","side_projects/","side_projects/woodworking/","side_projects/embedded_eng/","side_projects/homestead/","side_projects/spoken_language/","side_projects/queer/"],"tags":[],"content":"\nHi! I’m Aster, pronouns she/her. I’m a seasoned full-stack engineer with over eleven years experience building scaleable web applications for a variety of markets. I’m currently a Senior Software Engineer at Plume, working to weave trans equity into the fabric of healthcare technology. My journey has taken me from places like The New York Times and Medium to where I am now, passionately working remotely (and loving it!).\nIn my world, tech is more than just code; it’s a path to making things fairer for everyone. I’ve got a knack for full-stack web development and a soft spot for creating slick infrastructure and data pipelines – think Cloudflare, Fastly, AWS Lambda, you name it. And yes, I’m that person who gets excited about continuous deployment. I’m currently studying embedded engineering in my spare time, and thoroughly enjoy building systems that help people in a tangible way.\nBut hey, life’s not all about tech, right? When I’m not coding, you might find me in my garden, woodworking, or plunking out a melody on my MIDI boards. I believe in balancing the digital with the down-to-earth, which helps keeps me grounded when things get a bit too theoretical.\nSo, that’s a bit about me. I’m here to make a mark, not just in tech, but in how we think about equity and accessibility in this ever-evolving digital age. Let’s connect and make some waves!\n\nWork Experience\nVolunteer Experience\nSide Projects\n\nWoodworking\nEmbedded Engineering\nHomesteading\nSpoken Language Learning\nQueer Theory\n\n\n"},"side_projects/embedded_eng/index":{"title":"Side Projects: Embedded Engineering","links":["side_projects/embedded_eng/mmwave_presence_detection"],"tags":[],"content":"\nnote: I’m still building out this page, check back soon for more info\nI’ve got a few embedded engineering projects I’ve been playing with:\n\nmmWave Presence Detection\nMIDI controllers\nLoRA communication\n"},"side_projects/embedded_eng/lora_comms":{"title":"Side Projects: Embedded Engineering: LoRA Communications","links":[],"tags":[],"content":""},"side_projects/embedded_eng/midi_controllers":{"title":"Side Projects: Embedded Engineering: MIDI music controllers","links":[],"tags":[],"content":""},"side_projects/embedded_eng/mmwave_presence_detection":{"title":"Side Projects: Embedded Engineering: mmWave Presence Detection","links":[],"tags":[],"content":"Using Seeed Studio’s Xiao modules, I’m currently learning how to detect human presence in a non-invasive manner, via the 24GHz mmWave Sensor\nLong-term, the end goal of these would be not only for home automation, but I’d like to build out smart lighting on my property, similar to those shown in the TV show Devs:\n\nScreenshot from Devs, courtesy of FX. Included for illustrative purposes only.\n…with the notable difference that I want my version to only engage when a person is nearby. Light pollution in the country is a major problem, and the more I can keep lighting at night focused where it needs to be, the better."},"side_projects/homestead/index":{"title":"Side Projects: Homesteading","links":["side_projects/woodworking/"],"tags":[],"content":"\nnote: I’m still building out this page, check back soon for more info\nA couple years back I made the leap and purchased a house and land in the western mountains of Maine, where I’m now living. Living out in the country has its own challenges, not only unique to homeownership, but also property stewardship and cultivation. Some things I’m thinking about on that front:\n\nElectrical grid reliance, what options are available for solar, wind, micro-hydro power generation\nArboriculture, the majority of our property is thickly forested, and learning how to maintain that in a sustainable fashion is important for me.\nWinterization, the winters in Maine can be harsh and unforgiving, and learning how to leave comfortably when there’s 5-6 feet of snow outside is an area of interest\nGardening and farming, I thoroughly enjoy cultivating practical use from the land, and growing my own fruit and vegetables is a great way to do that. My tilled plots are still small, but I’m learning more Woodworking in order to steadily build out my and my partner’s plans.\nStellar Photography, with how little light pollution there is out here, I eventually want to build a small observatory to both study and capture the stars. I don’t have any specific works showcasing this yet, but it’s on the horizon.\n"},"side_projects/index":{"title":"Side Projects","links":["side_projects/embedded_eng/","side_projects/woodworking/","side_projects/homestead/","side_projects/spoken_language/","side_projects/queer/"],"tags":[],"content":"If there’s one thing you should know about me, it’s that I thrive on variety. My mind is a buzzing hub of ideas, constantly exploring new horizons. This passion for diverse pursuits has led me to embark on an array of side projects, each uniquely enriching and challenging.\nFrom dabbling in the latest web technologies to experimenting with digital art, every project is a journey into uncharted territory. I’ve found joy in gardening, where the rhythmic nature of nurturing plants offers a serene counterbalance to the digital world. My musical endeavors, whether it’s mastering a new instrument or composing, fuel my creativity in unexpected ways. Below you’ll find a number of projects I’ve worked on that I thoroughly enjoy.\nEmbedded Engineering\nWoodworking\nHomesteading\nSpoken Language Learning\nQueer Theory"},"side_projects/queer/index":{"title":"Side Projects: Queer Theory","links":["volunteer/sfgmc/","work/2023may-plume"],"tags":[],"content":"\nnote: I’m still building out this page, check back soon for more info\nHow people interact with their gender identity and sexuality is something that’s fascinated me for years, not only because of my own journeys with them, but also how conceptually these out groups have interacted with society as a whole, how they act and interact with each other, and how they support and build each other up in the face of growing public backlash for simply existing.\nMy work with SFGMC volunteering both as a singer and on their tech task force, and professionally with Plume Clinic, both highlight this interest, and have helped fuel my interest and community in countless ways."},"side_projects/spoken_language/index":{"title":"Side Projects: Spoken Language Learning","links":[],"tags":[],"content":"\nnote: I’m still building out this page, check back soon for more info\nI currently speak Spanish as a second language (intermediate level) and am currently working on learning French (beginner level, and Canadian french in specific, due to my proximity to Quebec)"},"side_projects/woodworking/index":{"title":"Side Projects: Woodworking","links":[],"tags":[],"content":"note: I’m still building out this page, check back soon for more info"},"volunteer/cfsf/index":{"title":"Volunteer Work: Code for San Francisco","links":[],"tags":[],"content":"note: I’m still building out this page, check back soon for more info"},"volunteer/index":{"title":"Volunteer Experience","links":["volunteer/node_meetup/","volunteer/nodejs_foundation/","volunteer/cfsf/","volunteer/sfgmc/"],"tags":[],"content":"note: I’m still building out this page, check back soon for more info\nI’ve done quite a bit of volunteering in my time. Here’s a snippet of them:\n\nNode Ninjas Meetup Groups\nNode.js Foundation Web Working Group\nCode for San Francisco\nSan Francisco Gay Mens’ Chorus\n"},"volunteer/node_meetup/index":{"title":"Volunteer Work: Node Ninja Meetup Groups","links":[],"tags":[],"content":"note: I’m still building out this page, check back soon for more info"},"volunteer/nodejs_foundation/index":{"title":"Volunteer Work: Node.js Foundation Web Working Group","links":[],"tags":[],"content":"note: I’m still building out this page, check back soon for more info"},"volunteer/sfgmc/index":{"title":"Volunteer Work: San Francisco Gay Mens' Chorus","links":[],"tags":[],"content":"note: I’m still building out this page, check back soon for more info"},"work/2013mar-rain":{"title":"2013-2014 RAIN","links":[],"tags":[],"content":"\nnote: I’m still building out this page, check back soon for more info"},"work/2014aug-grow":{"title":"2014-2015 Grow.com","links":[],"tags":[],"content":"\nnote: I’m still building out this page, check back soon for more info"},"work/2015mar-mashape":{"title":"2015-2016 Mashape","links":[],"tags":[],"content":"\nnote: I’m still building out this page, check back soon for more info"},"work/2016aug-segment":{"title":"2016-2017 Segment/Twilio","links":[],"tags":[],"content":"\nnote: I’m still building out this page, check back soon for more info"},"work/2017sep-saleae":{"title":"2017-2019 Saleae","links":[],"tags":[],"content":"\nnote: I’m still building out this page, check back soon for more info"},"work/2019sep-medium":{"title":"2019-2021 Medium.com","links":[],"tags":[],"content":"\nnote: I’m still building out this page, check back soon for more info"},"work/2021jul-nyt":{"title":"2021-2023 The New York Times","links":[],"tags":[],"content":"\nnote: I’m still building out this page, check back soon for more info"},"work/2023may-plume":{"title":"2023-now -  Plume Clinic","links":[],"tags":[],"content":"\nnote: I’m still building out this page, check back soon for more info"},"work/index":{"title":"Work Experience","links":["work/2023may-plume","work/2021jul-nyt","work/2019sep-medium","work/2017sep-saleae","work/2016aug-segment","work/2015mar-mashape","work/2014aug-grow","work/2013mar-rain"],"tags":[],"content":"\nI’ve worked in a swath of different business sectors, ranging from startups to enterprises, from direct-to-consumer to B2B. My programming languages have been primarily Javascript (client &amp; server) and more recently, Typescript, with smatterings of Golang and Python thrown in there. I’ve also pushed major internal tooling initiatives at multiple companies, saving stakeholders countless hours of otherwise manual processes, those have leaned toward the JS side, though they also leveraged bash command-line tooling, Chrome extension development, and Electron development.\nIf you’re looking for a one-pager with my experience, please check out my linkedin profile\nMay 2023 to present - Plume\nJuly 2021 to Jan 2023 - The New York Times\nSept 2019 to May 2021 - Medium\nSept 2017 to Aug 2019 - Saleae\nAug 2016 to Aug 2017 - Segment (now Twilio)\nMar 2015 to Aug 2017 - Mashape (now Kong)\nAug 2014 to Mar 2015 - Grow\nMar 2013 to July 2014 - RAIN"}}